import datetime
#import pytz


#tz = pytz.timezone('Europe/Minsk')


# Первая пара
FIRTS_START = datetime.time(5, 30)  # Начало
FIRST_END = datetime.time(7, 5)  # Конец

# Вторая пара
SECOND_START = datetime.time(7, 25)
SECOND_END = datetime.time(9)

# Третья пара
THIRD_START = datetime.time(9, 30)
THIRD_END = datetime.time(11, 5)

# Четвертая пара
FOURTH_START = datetime.time(11, 20)
FOURTH_END = datetime.time(12, 55)

# Пятая пара
FIFTH_START = datetime.time(13, 5)
FIFTH_END = datetime.time(14, 40)

# Начало дня
DAY_START = datetime.time(21, 0, 0)

# Конец дня
DAY_END = datetime.time(20, 59, 59)


down_monday = [' <b>•</b> <i>Аналитическая геометрия</i> лекция <b>418</b>',
               ' <b>•</b> <i>Английский язык</i> <b>521/523</b>',
               ' <b>•</b> <i>Аналитическая геометрия</i> практика <b>533</b>',
               ' <b>•</b> <i>Математический анализ</i> <b>533</b>',
               ' <b>✕</b> Пятой пары нет']

down_tuesday = [' <b>•</b> <i>Физическая культура и здоровье</i>',
                ' <b>•</b> <i>Математический анализ</i> <b>533</b>',
                ' <b>•</b> <i>Дискретная математика</i> лекция <b>411 к4</b>',
                ' <b>✕</b> Четвертой пары нет',
                ' <b>✕</b> Пятой пары нет']

down_wednesday = [' <b>•</b <b>✖</b> > <i>Охрана труда</i> <b>237</b> (осталась 1 пара)',
                  ' <b>•</b> <i>ВМА</i> лекция <b>301</b>',
                  ' <b>•</b> <i>Программирование</i> лекция <b>530</b>',
                  ' <b>•</b> <i>Дискретная математика</i> практика <b>202 к4</b>',
                  ' <b>•</b> <i>Программирование</i> практика (первая группа) <b>405</b>']

down_thursday = [' <b>•</b> <i>Физическая культура и здоровье</i>',
                 ' <b>•</b> <i>Дискретная математика</i> лекция <b>507 к4</b>',
                 ' <b>•</b> <i>Математический анализ</i> <b>533</b>',
                 ' <b>•</b> <i>ВМА</i> практика <b>405</b> (первая группа)',
                 ' <b>✕</b> Пятой пары нет']

down_friday = [' <b>•</b> <i>Программирование</i> практика (вторая группа) <b>405</b>',
               ' <b>•</b> <i>ВМА</i> практика (вторая группа) <b>405</b>',
               ' <b>•</b> <i>Английский язык</i> <b>513/529</b>',
               ' <b>•</b> <i>Математический анализ</i> <b>533</b>',
               ' <b>✕</b> Пятой пары нет']


up_monday = [' <b>•</b> <i>Аналитическая геометрия</i> лекция <b>418</b>',
             ' <b>•</b> <i>Английский язык</i> <b>521/523</b>',
             ' <b>•</b> <i>Аналитическая геометрия</i> практика <b>533</b>',
             ' <b>•</b> <i>Математический анализ</i> <b>533</b>',
             ' <b>✕</b> Пятой пары нет']

up_tuesday = [' <b>•</b> <i>Физическая культура и здоровье</i>',
              ' <b>•</b> <i>Математический анализ</i> <b>533</b>',
              ' <b>•</b> <i>Дискретная математика</i> лекция <b>411 к4</b>',
              ' <b>✕</b> Четвертой пары нет',
              ' <b>•</b> <i>Коррупция</i> <b>411 к4</b> (осталась 1 пара)']

up_wednesday = [' <b>•</b> Первой пары нет',
                ' <b>•</b> <i>ВМА</i> лекция <b>301</b>',
                ' <b>•</b> <i>Программирование</i> лекция <b>530</b>',
                ' <b>•</b> <i>Дискретная математика</i> практика <b>202 к4</b>',
                ' <b>•</b> <i>Программирование</i> практика (вторая группа) <b>405</b>']

up_thursday = [' <b>•</b> <i>Физическая культура и здоровье</i>',
               ' <b>•</b> <i>Дискретная математика</i> практика <b>402 к4</b>',
               ' <b>•</b> <i>Математический анализ</i> <b>533</b>',
               ' <b>•</b> <i>ВМА</i> практика <b>405</b> (вторая группа)',
               ' <b>✕</b> Пятой пары нет']

up_friday = [' <b>•</b> <i>Программирование</i> практика (первая группа) <b>405</b>',
             ' <b>•</b> <i>ВМА</i> практика (первая группа) <b>405</b>',
             ' <b>•</b> <i>Английский язык</i> <b>513/529</b>',
             ' <b>•</b> <i>Математический анализ</i> <b>533</b>',
             ' <b>✕</b> Пятой пары нет']


down_week = {
    0: down_monday,
    1: down_tuesday,
    2: down_wednesday,
    3: down_thursday,
    4: down_friday}

up_week = {
    0: up_monday,
    1: up_tuesday,
    2: up_wednesday,
    3: up_thursday,
    4: up_friday}
