from datetime import time, datetime
import pytz


def utc_times(hours: int = 0, minutes: int = 0, seconds: int = 0, timezone_name: str = 'Europe/Minsk'):
    """Преобразует объект time по локальному поясу в time по UTC"""
    tz = pytz.timezone(timezone_name)
    utc_timezone = pytz.utc
    local_time = time(hours, minutes, seconds)
    _datetime = datetime.combine(datetime.today(), local_time)
    local_datime = tz.localize(_datetime)
    return local_datime.astimezone(utc_timezone).time()


# Первая пара
FIRTS_START = utc_times(8, 30)  # Начало
FIRST_END = utc_times(10, 5)  # Конец

# Вторая пара
SECOND_START = utc_times(10, 25)
SECOND_END = utc_times(12)

# Третья пара
THIRD_START = utc_times(12, 30)
THIRD_END = utc_times(14, 5)

# Четвертая пара
FOURTH_START = utc_times(14, 20)
FOURTH_END = utc_times(15, 55)

# Пятая пара
FIFTH_START = utc_times(16, 5)
FIFTH_END = utc_times(17, 40)

# Начало дня
DAY_START = utc_times(3, 0)

# Конец дня
DAY_END = utc_times(23, 59)


down_monday = [' <b>•</b> <i>Аналитическая геометрия</i> лекция <b>418</b>',
               ' <b>•</b> <i>Английский язык</i> <b>521/523</b>',
               ' <b>•</b> <i>Аналитическая геометрия</i> практика <b>533</b>',
               ' <b>•</b> <i>Математический анализ</i> <b>533</b>',
               ' <b>✕</b> Пятой пары нет']

down_tuesday = [' <b>•</b> <i>Физическая культура и здоровье</i>',
                ' <b>•</b> <i>Математический анализ</i> <b>533</b>',
                ' <b>•</b> <i>Дискретная математика</i> лекция <b>411 к4</b>',
                ' <b>✕</b> Четвертой пары нет',
                ' <b>✕</b> Пятой пары нет']

down_wednesday = [' <b>•</b <b>✖</b> > <i>Охрана труда</i> <b>237</b> (осталась 1 пара)',
                  ' <b>•</b> <i>ВМА</i> лекция <b>301</b>',
                  ' <b>•</b> <i>Программирование</i> лекция <b>530</b>',
                  ' <b>•</b> <i>Дискретная математика</i> практика <b>202 к4</b>',
                  ' <b>•</b> <i>Программирование</i> практика (первая группа) <b>405</b>']

down_thursday = [' <b>•</b> <i>Физическая культура и здоровье</i>',
                 ' <b>•</b> <i>Дискретная математика</i> лекция <b>507 к4</b>',
                 ' <b>•</b> <i>Математический анализ</i> <b>533</b>',
                 ' <b>•</b> <i>ВМА</i> практика <b>405</b> (первая группа)',
                 ' <b>✕</b> Пятой пары нет']

down_friday = [' <b>•</b> <i>Программирование</i> практика (вторая группа) <b>405</b>',
               ' <b>•</b> <i>ВМА</i> практика (вторая группа) <b>405</b>',
               ' <b>•</b> <i>Английский язык</i> <b>513/529</b>',
               ' <b>•</b> <i>Математический анализ</i> <b>533</b>',
               ' <b>✕</b> Пятой пары нет']


up_monday = [' <b>•</b> <i>Аналитическая геометрия</i> лекция <b>418</b>',
             ' <b>•</b> <i>Английский язык</i> <b>521/523</b>',
             ' <b>•</b> <i>Аналитическая геометрия</i> практика <b>533</b>',
             ' <b>•</b> <i>Математический анализ</i> <b>533</b>',
             ' <b>✕</b> Пятой пары нет']

up_tuesday = [' <b>•</b> <i>Физическая культура и здоровье</i>',
              ' <b>•</b> <i>Математический анализ</i> <b>533</b>',
              ' <b>•</b> <i>Дискретная математика</i> лекция <b>411 к4</b>',
              ' <b>✕</b> Четвертой пары нет',
              ' <b>✕</b> Пятой пары нет']

up_wednesday = [' <b>•</b> Первой пары нет',
                ' <b>•</b> <i>ВМА</i> лекция <b>301</b>',
                ' <b>•</b> <i>Программирование</i> лекция <b>530</b>',
                ' <b>•</b> <i>Дискретная математика</i> практика <b>202 к4</b>',
                ' <b>•</b> <i>Программирование</i> практика (вторая группа) <b>405</b>']

up_thursday = [' <b>•</b> <i>Физическая культура и здоровье</i>',
               ' <b>•</b> <i>Дискретная математика</i> практика <b>402 к4</b>',
               ' <b>•</b> <i>Математический анализ</i> <b>533</b>',
               ' <b>•</b> <i>ВМА</i> практика <b>405</b> (вторая группа)',
               ' <b>✕</b> Пятой пары нет']

up_friday = [' <b>•</b> <i>Программирование</i> практика (первая группа) <b>405</b>',
             ' <b>•</b> <i>ВМА</i> практика (первая группа) <b>405</b>',
             ' <b>•</b> <i>Английский язык</i> <b>513/529</b>',
             ' <b>•</b> <i>Математический анализ</i> <b>533</b>',
             ' <b>✕</b> Пятой пары нет']


down_week = {
    0: down_monday,
    1: down_tuesday,
    2: down_wednesday,
    3: down_thursday,
    4: down_friday}

up_week = {
    0: up_monday,
    1: up_tuesday,
    2: up_wednesday,
    3: up_thursday,
    4: up_friday}
