MONDAY_DOWN = '1️⃣<u><b>Понедельник:</b></u>\n' \
              ' 💠 <i>Аналитическая геометрия</i> лекция <b>418</b>\n' \
              ' 💠 <i>Английский язык</i> <b>521/523</b>\n' \
              ' 💠 <i>Аналитическая геометрия</i> практика <b>533</b>\n' \
              ' 💠 <i>Математический анализ</i> <b>533</b>'

TUESDAY_DOWN = '2️⃣<u><b>Вторник:</b></u>\n' \
               ' 💠 <i>Физическая культура и здоровье</i>\n' \
               ' 💠 <i>Математический анализ</i> <b>533</b>\n' \
               ' 💠 <i>Дискретная математика</i> лекция <b>411 к4</b>'

WEDNESDAY_DOWN = '3️⃣<u><b>Среда:</b></u>\n' \
                 ' 💠 <i>Охрана труда</i> <b>237</b> (осталась 1 пара)\n' \
                 ' 💠 <i>ВМА</i> лекция <b>301</b>\n' \
                 ' 💠 <i>Программирование</i> лекция <b>530</b>\n' \
                 ' 💠 <i>Дискретная математика</i> практика <b>202 к4</b>\n' \
                 ' 💠 <i>Программирование</i> практика (первая группа) <b>405</b>'

THURSDAY_DOWN = '4️⃣<u><b>Четверг:</b></u>\n' \
                ' 💠 <i>Физическая культура и здоровье</i>\n' \
                ' 💠 <i>Дискретная математика</i> лекция <b>507 к4</b>\n' \
                ' 💠 <i>Математический анализ</i> <b>533</b>\n' \
                ' 💠 <i>ВМА</i> практика <b>405</b> (первая группа)'

FRIDAY_DOWN = '5️⃣<u><b>Пятница:</b></u>\n' \
              ' 💠 <i>Программирование</i> практика (вторая группа) <b>405</b>\n' \
              ' 💠 <i>ВМА</i> практика (вторая группа) <b>405</b>\n' \
              ' 💠 <i>Английский язык</i> <b>513/529</b>\n' \
              ' 💠 <i>Математический анализ</i> <b>533</b>'


MONDAY_UP = '1️⃣<u><b>Понедельник:</b></u>\n' \
            ' 💠 <i>Аналитическая геометрия</i> лекция <b>418</b>\n' \
            ' 💠 <i>Английский язык</i> <b>521/523</b>\n' \
            ' 💠 <i>Аналитическая геометрия</i> практика <b>533</b>\n' \
            ' 💠 <i>Математический анализ</i> <b>533</b>'

TUESDAY_UP = '2️⃣<u><b>Вторник:</b></u>\n' \
             ' 💠 <i>Физическая культура и здоровье</i>\n' \
             ' 💠 <i>Математический анализ</i> <b>533</b>\n' \
             ' 💠 <i>Дискретная математика</i> лекция <b>411 к4</b>\n' \
             ' 🔻 Четвертой пары нет\n' \
             ' 💠 <i>Коррупция</i> <b>411 к4</b> (осталась 1 пара)'

WEDNESDAY_UP = '3️⃣<u><b>Среда:</b></u>\n' \
               ' 💠 Первой пары нет\n' \
               ' 💠 <i>ВМА</i> лекция <b>301</b>\n' \
               ' 💠 <i>Программирование</i> лекция <b>530</b>\n' \
               ' 💠 <i>Дискретная математика</i> практика <b>202 к4</b>\n' \
               ' 💠 <i>Программирование</i> практика (вторая группа) <b>405</b>'

THURSDAY_UP = '4️⃣<u><b>Четверг:</b></u>\n' \
              ' 💠 <i>Физическая культура и здоровье</i>\n' \
              ' 💠 <i>Дискретная математика</i> практика <b>402 к4</b>\n' \
              ' 💠 <i>Математический анализ</i> <b>533</b>\n' \
              ' 💠 <i>ВМА</i> практика <b>405</b> (вторая группа)'

FRIDAY_UP = '5️⃣<u><b>Пятница:</b></u>\n' \
            ' 💠 <i>Программирование</i> практика (первая группа) <b>405</b>\n' \
            ' 💠 <i>ВМА</i> практика (первая группа) <b>405</b>\n' \
            ' 💠 <i>Английский язык</i> <b>513/529</b>\n' \
            ' 💠 <i>Математический анализ</i> <b>533</b>'
