MONDAY_DOWN = 'Понедельник:\n' \
              ' - Аналитическая геометрия лекция 418\n' \
              ' - Английский язык 521/523\n' \
              ' - Аналитическая геометрия практика 533\n' \
              ' - Математический анализ 533\n\n'

MONDAY_UP = 'Понедельник:\n' \
            ' - Аналитическая геометрия лекция 418\n' \
            ' - Английский язык 521/523\n' \
            ' - Аналитическая геометрия практика 533\n' \
            ' - Математический анализ 533\n\n'


TUESDAY_DOWN = 'Вторник:\n' \
               ' - Физическая культура и здоровье\n' \
               ' - Математический анализ 533\n' \
               ' - Дискретная математика лекция 411 к4\n\n'

TUESDAY_UP = 'Вторник:\n' \
             ' - Физическая культура и здоровье\n' \
             ' - Математический анализ 533\n' \
             ' - Дискретная математика лекция 411 к4\n' \
             ' - Четвертой пары нет\n' \
             ' - Коррупция 411 к4 (осталось 2 пары)\n\n'


WEDNESDAY_DOWN = 'Среда:\n' \
                 ' - Охрана труда 237 (осталась 1 пара)\n' \
                 ' - ВМА лекция 301\n' \
                 ' - Программирование лекция 530\n' \
                 ' - Дискретная математика практика 202 к4\n' \
                 ' - Программирование практика (первая группа) 405\n\n'

WEDNESDAY_UP = 'Среда:\n' \
               ' - Первой пары нет\n' \
               ' - ВМА лекция 301\n' \
               ' - Программирование лекция 530\n' \
               ' - Дискретная математика практика 202 к4\n' \
               ' - Программирование практика (вторая группа) 405\n\n'


THURSDAY_DOWN = 'Четверг:\n' \
                ' - Физическая культура и здоровье\n' \
                ' - Дискретная математика лекция 507 к4\n' \
                ' - Математический анализ 533\n' \
                ' - ВМА практика 405 (первая группа)\n\n'

THURSDAY_UP = 'Четверг:\n' \
              ' - Физическая культура и здоровье\n' \
              ' - Дискретная математика практика 402 к4\n' \
              ' - Математический анализ 533\n' \
              ' - ВМА практика 405 (вторая группа)\n\n'


FRIDAY_DOWN = 'Пятница:\n' \
              ' - Программирование практика (вторая группа) 405\n' \
              ' - ВМА практика (вторая группа) 405\n' \
              ' - Английский язык 513/529\n' \
              ' - Математический анализ 533'

FRIDAY_UP = 'Пятница:\n' \
            ' - Программирование практика (первая группа) 405\n' \
            ' - ВМА практика (первая группа) 405\n' \
            ' - Английский язык 513/529\n' \
            ' - Математический анализ 533'
