MONDAY_DOWN = '1️⃣<u><b>Понедельник:</b></u>\n' \
              ' <b>•</b> <i>Основы права</i> лекция <b>533</b>\n' \
              ' <b>•</b> <i>Английский язык</i> <b>513</b>\n' \
              ' <b>•</b> <i>Численный анализ</i> лекция <b>322</b>\n' \
              ' <b>•</b> <i>СМС/ЧA</i> практики <b>233/405</b>'

TUESDAY_DOWN = '2️⃣<u><b>Вторник:</b></u>\n' \
               ' <b>•</b> <i>Теория вероятности и случайные процессы</i> практика <b>407</b>\n' \
               ' <b>•</b> <i>Физра</i>\n' \
               ' <b>•</b> <i>Основы права</i> практика <b>549</b>\n' \
               ' <b>•</b> <i>ОДУ</i> лекция <b>533</b>'

WEDNESDAY_DOWN = '3️⃣<u><b>Среда:</b></u>\n' \
                 ' <b>•</b> <i>Численный анализ</i> практика <b>405</b> (первая группа)\n' \
                 ' <b>•</b> <i>МатЛог и ТеорАлг</i> лекция <b>403 к4</b>\n' \
                 ' <b>•</b> <i>Английский язык</i> <b>529</b>\n' \
                 ' <b>•</b> <i>МатЛог и ТеорАлг</i> практика <b>549</b>'

THURSDAY_DOWN = '4️⃣<u><b>Четверг:</b></u>\n' \
                ' <b>•</b> <i>Теория вероятности и случайные процессы</i> лекция <b>530</b>\n' \
                ' <b>•</b> <i>Современные математические системы</i> лекция <b>508</b>\n' \
                ' <b>•</b> <i>Философия</i> лекция <b>509</b>\n' \
                ' <b>•</b> <i>СМС</i> практика <b>233</b> (вторая группа)'

FRIDAY_DOWN = '5️⃣<u><b>Пятница:</b></u>\n' \
              ' <b>•</b> <i>Философия</i> практика <b>303</b>\n' \
              ' <b>•</b> <i>ОДУ</i> практика <b>534</b>\n' \
              ' <b>•</b> <i>Физра</i>'


MONDAY_UP = '1️⃣<u><b>Понедельник:</b></u>\n' \
            ' <b>✕</b> Первой пары нет\n' \
            ' <b>•</b> <i>Английский язык</i> <b>513</b>\n' \
            ' <b>•</b> <i>Численный анализ</i> лекция <b>322</b>\n' \
            ' <b>•</b> <i>СМС/ЧA</i> практики <b>233/405</b>'

TUESDAY_UP = '2️⃣<u><b>Вторник:</b></u>\n' \
             ' <b>•</b> <i>Теория вероятности и случайные процессы</i> практика <b>407</b>\n' \
             ' <b>•</b> <i>Физра</i>\n' \
             ' <b>•</b> <i>Основы права</i> практика <b>549</b>\n' \
             ' <b>•</b> <i>ОДУ</i> лекция <b>533</b>'

WEDNESDAY_UP = '3️⃣<u><b>Среда:</b></u>\n' \
               ' <b>•</b> <i>Численный анализ</i> практика <b>405</b> (первая группа)\n' \
               ' <b>•</b> <i>МатЛог и ТеорАлг</i> лекция <b>403 к4</b>\n' \
               ' <b>•</b> <i>Английский язык</i> <b>529</b>\n' \
               ' <b>•</b> <i>МатЛог и ТеорАлг</i> практика <b>549</b>'

THURSDAY_UP = '4️⃣<u><b>Четверг:</b></u>\n' \
              ' <b>•</b> <i>Теория вероятности и случайные процессы</i> лекция <b>530</b>\n' \
              ' <b>•</b> <i>Современные математические системы</i> лекция <b>508</b>\n' \
              ' <b>•</b> <i>Философия</i> лекция <b>509</b>\n' \
              ' <b>•</b> <i>СМС</i> практика <b>233</b> (вторая группа)'

FRIDAY_UP = '5️⃣<u><b>Пятница:</b></u>\n' \
            ' <b>•</b> <i>Философия</i> практика <b>303</b>\n' \
            ' <b>•</b> <i>ОДУ</i> практика <b>534</b>\n' \
            ' <b>•</b> <i>Физра</i>'
