WEEK = '1️⃣<u><b>Понедельник:</b></u>\n' \
       ' 💠 <i>Аналитическая геометрия</i> лекция 418\n' \
       ' 💠 <i>Английский язык</i> 521/523\n' \
       ' 💠 <i>Аналитическая геометрия</i> практика 533\n' \
       ' 💠 <i>Математический анализ</i> 533\n\n' \
       '' \
       '2️⃣<u><b>Вторник:</b></u>\n' \
       ' 💠 <i>Физическая культура и здоровье</i>\n' \
       ' 💠 <i>Математический анализ</i> 533\n' \
       ' 💠 <i>Дискретная математика</i> лекция 411 к4\n' \
       ' 💠 Четвертой пары нет\n' \
       ' 💠 <i>Коррупция</i> (верх) 411 к4 (осталась 1 пара)\n\n' \
       '' \
       '3️⃣<u><b>Среда:</b></u>\n' \
       ' 💠 <i>Охрана труда</i> (низ) 237 (осталась 1 пара)\n' \
       ' 💠 <i>ВМА</i> лекция 301\n' \
       ' 💠 <i>Программирование</i> лекция 530\n' \
       ' 💠 <i>Дискретная математика</i> практика 202 к4\n' \
       ' 💠 <i>Программирование</i> практика (низ - первая, верх - вторая) 405\n\n' \
       '' \
       '4️⃣<u><b>Четверг:</b></u>\n' \
       ' 💠 <i>Физическая культура и здоровье</i>\n' \
       ' 💠 <i>Дискретная математика</i> (низ - практика 507 к4, верх - лекция 402 к4)\n' \
       ' 💠 <i>Математический анализ</i> 533\n' \
       ' 💠 <i>ВМА</i> практика 405 (низ - первая, верх - вторая)\n\n' \
       '' \
       '5️⃣<u><b>Пятница:</b></u>\n' \
       ' 💠 <i>Программирование</i> практика (низ - вторая, верх - первая) 405\n' \
       ' 💠 <i>ВМА</i> практика (низ - вторая, верх - первая) 405\n' \
       ' 💠 <i>Английский язык</i> 513/529\n' \
       ' 💠 <i>Математический анализ</i> 533'


DOWN_WEEK = '1️⃣<u><b>Понедельник:</b></u>\n' \
            ' 💠 <i>Аналитическая геометрия</i> лекция 418\n' \
            ' 💠 <i>Английский язык</i> 521/523\n' \
            ' 💠 <i>Аналитическая геометрия</i> практика 533\n' \
            ' 💠 <i>Математический анализ</i> 533\n\n' \
            '' \
            '2️⃣<u><b>Вторник:</b></u>\n' \
            ' 💠 <i>Физическая культура и здоровье</i>\n' \
            ' 💠 <i>Математический анализ</i> 533\n' \
            ' 💠 <i>Дискретная математика</i> лекция 411 к4\n\n' \
            '' \
            '3️⃣<u><b>Среда:</b></u>\n' \
            ' 💠 <i>Охрана труда</i> 237 (осталась 1 пара)\n' \
            ' 💠 <i>ВМА</i> лекция 301\n' \
            ' 💠 <i>Программирование</i> лекция 530\n' \
            ' 💠 <i>Дискретная математика</i> практика 202 к4\n' \
            ' 💠 <i>Программирование</i> практика (первая группа) 405\n\n' \
            '' \
            '4️⃣<u><b>Четверг:</b></u>\n' \
            ' 💠 <i>Физическая культура и здоровье</i>\n' \
            ' 💠 <i>Дискретная математика</i> лекция 507 к4\n' \
            ' 💠 <i>Математический анализ</i> 533\n' \
            ' 💠 <i>ВМА</i> практика 405 (первая группа)\n\n' \
            '' \
            '5️⃣<u><b>Пятница:</b></u>\n' \
            ' 💠 <i>Программирование</i> практика (вторая группа) 405\n' \
            ' 💠 <i>ВМА</i> практика (вторая группа) 405\n' \
            ' 💠 <i>Английский язык</i> 513/529\n' \
            ' 💠 <i>Математический анализ</i> 533'


UP_WEEK = '1️⃣<u><b>Понедельник:</b></u>\n' \
          ' 💠 <i>Аналитическая геометрия</i> лекция 418\n' \
          ' 💠 <i>Английский язык</i> 521/523\n' \
          ' 💠 <i>Аналитическая геометрия</i> практика 533\n' \
          ' 💠 <i>Математический анализ</i> 533\n\n' \
          '' \
          '2️⃣<u><b>Вторник:</b></u>\n' \
          ' 💠 <i>Физическая культура и здоровье</i>\n' \
          ' 💠 <i>Математический анализ</i> 533\n' \
          ' 💠 <i>Дискретная математика</i> лекция 411 к4\n' \
          ' 💠 Четвертой пары нет\n' \
          ' 💠 <i>Коррупция</i> 411 к4 (осталась 1 пара)\n\n' \
          '' \
          '3️⃣<u><b>Среда:</b></u>\n' \
          ' 💠 Первой пары нет\n' \
          ' 💠 <i>ВМА</i> лекция 301\n' \
          ' 💠 <i>Программирование</i> лекция 530\n' \
          ' 💠 <i>Дискретная математика</i> практика 202 к4\n' \
          ' 💠 <i>Программирование</i> практика (вторая группа) 405\n\n' \
          '' \
          '4️⃣<u><b>Четверг:</b></u>\n' \
          ' 💠 <i>Физическая культура и здоровье</i>\n' \
          ' 💠 <i>Дискретная математика</i> практика 402 к4\n' \
          ' 💠 <i>Математический анализ</i> 533\n' \
          ' 💠 <i>ВМА</i> практика 405 (вторая группа)\n\n' \
          '' \
          '5️⃣<u><b>Пятница:</b></u>\n' \
          ' 💠 <i>Программирование</i> практика (первая группа) 405\n' \
          ' 💠 <i>ВМА</i> практика (первая группа) 405\n' \
          ' 💠 <i>Английский язык</i> 513/529\n' \
          ' 💠 <i>Математический анализ</i> 533'
