WEEK = '1️⃣<u><b>Понедельник:</b></u>\n' \
       ' <b>•</b> <i>Аналитическая геометрия</i> лекция <b>418</b>\n' \
       ' <b>•</b> <i>Английский язык</i> <b>521/523</b>\n' \
       ' <b>•</b> <i>Аналитическая геометрия</i> практика <b>533</b>\n' \
       ' <b>•</b> <i>Математический анализ</i> <b>533</b>\n\n' \
       '' \
       '2️⃣<u><b>Вторник:</b></u>\n' \
       ' <b>•</b> <i>Физическая культура и здоровье</i>\n' \
       ' <b>•</b> <i>Математический анализ</i> <b>533</b>\n' \
       ' <b>•</b> <i>Дискретная математика</i> лекция <b>411 к4</b>\n\n' \
       '' \
       '3️⃣<u><b>Среда:</b></u>\n' \
       ' <b>•</b> <i>Охрана труда</i> (низ) <b>237</b> (осталась 1 пара)\n' \
       ' <b>•</b> <i>ВМА</i> лекция <b>301</b>\n' \
       ' <b>•</b> <i>Программирование</i> лекция <b>530</b>\n' \
       ' <b>•</b> <i>Дискретная математика</i> практика <b>202 к4</b>\n' \
       ' <b>•</b> <i>Программирование</i> практика (низ - первая, верх - вторая) <b>405</b>\n\n' \
       '' \
       '4️⃣<u><b>Четверг:</b></u>\n' \
       ' <b>•</b> <i>Физическая культура и здоровье</i>\n' \
       ' <b>•</b> <i>Дискретная математика</i> (низ - практика <b>507 к4</b>, верх - лекция <b>402 к4</b>)\n' \
       ' <b>•</b> <i>Математический анализ</i> <b>533</b>\n' \
       ' <b>•</b> <i>ВМА</i> практика <b>405</b> (низ - первая, верх - вторая)\n\n' \
       '' \
       '5️⃣<u><b>Пятница:</b></u>\n' \
       ' <b>•</b> <i>Программирование</i> практика (низ - вторая, верх - первая) <b>405</b>\n' \
       ' <b>•</b> <i>ВМА</i> практика (низ - вторая, верх - первая) <b>405</b>\n' \
       ' <b>•</b> <i>Английский язык</i> <b>513/529</b>\n' \
       ' <b>•</b> <i>Математический анализ</i> <b>533</b>'


DOWN_WEEK = '1️⃣<u><b>Понедельник:</b></u>\n' \
            ' <b>•</b> <i>Аналитическая геометрия</i> лекция <b>418</b>\n' \
            ' <b>•</b> <i>Английский язык</i> <b>521/523</b>\n' \
            ' <b>•</b> <i>Аналитическая геометрия</i> практика <b>533</b>\n' \
            ' <b>•</b> <i>Математический анализ</i> <b>533</b>\n\n' \
            '' \
            '2️⃣<u><b>Вторник:</b></u>\n' \
            ' <b>•</b> <i>Физическая культура и здоровье</i>\n' \
            ' <b>•</b> <i>Математический анализ</i> <b>533</b>\n' \
            ' <b>•</b> <i>Дискретная математика</i> лекция <b>411 к4</b>\n\n' \
            '' \
            '3️⃣<u><b>Среда:</b></u>\n' \
            ' <b>•</b> <i>Охрана труда</i> <b>237</b> (осталась 1 пара)\n' \
            ' <b>•</b> <i>ВМА</i> лекция <b>301</b>\n' \
            ' <b>•</b> <i>Программирование</i> лекция <b>530</b>\n' \
            ' <b>•</b> <i>Дискретная математика</i> практика <b>202 к4</b>\n' \
            ' <b>•</b> <i>Программирование</i> практика (первая группа) <b>405</b>\n\n' \
            '' \
            '4️⃣<u><b>Четверг:</b></u>\n' \
            ' <b>•</b> <i>Физическая культура и здоровье</i>\n' \
            ' <b>•</b> <i>Дискретная математика</i> лекция <b>507 к4</b>\n' \
            ' <b>•</b> <i>Математический анализ</i> <b>533</b>\n' \
            ' <b>•</b> <i>ВМА</i> практика <b>405</b> (первая группа)\n\n' \
            '' \
            '5️⃣<u><b>Пятница:</b></u>\n' \
            ' <b>•</b> <i>Программирование</i> практика (вторая группа) <b>405</b>\n' \
            ' <b>•</b> <i>ВМА</i> практика (вторая группа) <b>405</b>\n' \
            ' <b>•</b> <i>Английский язык</i> <b>513/529</b>\n' \
            ' <b>•</b> <i>Математический анализ</i> <b>533</b>'


UP_WEEK = '1️⃣<u><b>Понедельник:</b></u>\n' \
          ' <b>•</b> <i>Аналитическая геометрия</i> лекция <b>418</b>\n' \
          ' <b>•</b> <i>Английский язык</i> <b>521/523</b>\n' \
          ' <b>•</b> <i>Аналитическая геометрия</i> практика <b>533</b>\n' \
          ' <b>•</b> <i>Математический анализ</i> <b>533</b>\n\n' \
          '' \
          '2️⃣<u><b>Вторник:</b></u>\n' \
          ' <b>•</b> <i>Физическая культура и здоровье</i>\n' \
          ' <b>•</b> <i>Математический анализ</i> <b>533</b>\n' \
          ' <b>•</b> <i>Дискретная математика</i> лекция <b>411 к4</b>\n\n' \
          '' \
          '3️⃣<u><b>Среда:</b></u>\n' \
          ' <b>✕</b> Первой пары нет\n' \
          ' <b>•</b> <i>ВМА</i> лекция <b>301</b>\n' \
          ' <b>•</b> <i>Программирование</i> лекция <b>530</b>\n' \
          ' <b>•</b> <i>Дискретная математика</i> практика <b>202 к4</b>\n' \
          ' <b>•</b> <i>Программирование</i> практика (вторая группа) <b>405</b>\n\n' \
          '' \
          '4️⃣<u><b>Четверг:</b></u>\n' \
          ' <b>•</b> <i>Физическая культура и здоровье</i>\n' \
          ' <b>•</b> <i>Дискретная математика</i> практика <b>402 к4</b>\n' \
          ' <b>•</b> <i>Математический анализ</i> <b>533</b>\n' \
          ' <b>•</b> <i>ВМА</i> практика <b>405</b> (вторая группа)\n\n' \
          '' \
          '5️⃣<u><b>Пятница:</b></u>\n' \
          ' <b>•</b> <i>Программирование</i> практика (первая группа) <b>405</b>\n' \
          ' <b>•</b> <i>ВМА</i> практика (первая группа) <b>405</b>\n' \
          ' <b>•</b> <i>Английский язык</i> <b>513/529</b>\n' \
          ' <b>•</b> <i>Математический анализ</i> <b>533</b>'
